Repository: 84000/data-translation-memory
Catalog: toh186-v2.tmx
Source language: bo
Languages: en

source: སྨན་གྱི་རྫས་སྣ་ཚོགས་ཀྱིས་སྐྱུག་པ་དང་། བཀྲུ་བ་དང་། ཕྱེ་མ་སྦྱར་བ་དང་། སྣ་ནས་བླུག་པའི་ལས་དང་། གཏར་ཀ་གདབ་པ་དང་། མར་དང་། འབྲུ་མར་བསྐོལ་བ་དང་། སྨིན་པར་བྱ་བ་རྣམས་སྦྱོར་བའི་ཐབས་ཀྱིས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ནད་དེ་དག་ཐམས་ཅད་ཉེ་བར་ཞི་བར་བྱེད་ཅིང་ནད་སྣ་ཚོགས་ཀྱི་འཇིགས་པ་ལས་ཡོངས་སུ་ཐར་བར་བྱེད་དོ། །
en: he cures the diseases of all beings and liberates them from the fear of diverse ailments through various medicinal substances, vomitives, purgatives, powders, sternutatory treatments, bleeding, ghee, boiled oil, and tonics.

source: ཀྱེ་རྒྱལ་བའི་བུ་དག་དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པས་ཀྱང་ཏིང་ངེ་འཛིན་སྣ་ཚོགས་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། སྟོབས་དང་། མི་འཇིགས་པ་དང་། ལྷའི་མིག་དང་། རྣ་བ་རྣམས་ཀྱི་ཚེའི་རིག་པ་ཡན་ལག་བརྒྱད་དང་ལྡན་ཏེ
en: “In the same way, noble sons of the Victorious One, the Tathāgata possesses eight branches of Āyurveda with the various states of concentration, the bases of supernatural powers, the powers, the assurances, and divine sight and hearing.

source: སེམས་ཅན་གྱི་ཁམས་དང་། བསམ་པ་དང་། སྦྱོར་བ་སྣ་ཚོགས་ལ་མཁས་པས་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་གི་ནད་དང་། ཉོན་མོངས་པ་དང་། ཉེ་བའི་ཉོན་མོངས་པའི་ནད་ཀྱིས་གཟིར་བའི་སེམས་ཅན་དང་། ང་རྒྱལ་དང་། རྒྱགས་པ་དང་། དྲེགས་པས་བསྒྲིབས་པ་དང་། ཆགས་པ་དང་། མྱ་ངན་དང་། འཇིགས་པ་དང་། ཁྲོ་བས་བསྒྲིབས་པ་རྣམས་སེམས་ཅན་དམྱལ་བ་དང་། དུད་འགྲོའི་སྐྱེ་གནས་དང་། ཡི་དགས་ཀྱི་སྐྱེ་གནས་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་གྱི་གནས་ནས་ཡོངས་སུ་ཐར་བར་བྱ་བའི་ཕྱིར་ཐབས་མཁས་པ་སྣ་ཚོགས་དང་། སྦྱོར་བ་སྣ་ཚོགས་དང་། ཏིང་ངེ་འཛིན་སྣ་ཚོགས་དང་། རྫུ་འཕྲུལ་གྱི་རྣམ་པར་རོལ་པས་སེམས་ཅན་རྣམས་ཡོངས་སུ་གྲོལ་བར་བྱས་ནས་
en: He is well versed in the various conditions of beings, their intentions, and their conduct. Thus he seeks to free from taking rebirth in hell or as animals, hungry ghosts, or in the world of Yama all those beings who are tormented by the diseases of desire, hatred, and bewilderment and by the sicknesses of the fundamental and secondary defilements, as well as those obscured by pride, vanity, and arrogance or by attachment, suffering, fear, and anger. To this end, by using various skillful means, various practices, various states of concentration, and supernatural powers, he brings beings to all stages of liberation

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་བར་ལ་བཀོད་ནས
en: up to and including their unsurpassable, perfect awakening, and thus

source: ལྷག་མ་མ་ལུས་པའི་མྱ་ངན་ལས་འདས་པའི་དབྱིངས་སུ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་མཛད་དོ། །
en: leads them to the extinction of their suffering in the sphere of remainderless parinirvāṇa.

source: མི་དགེ་བའི་ཆོས་བརྒྱད་ལས་ཡོངས་སུ་ཐར་བར་མཛད་ཅིང་འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ལ་སོ་སོར་འགོད་དེ།
en: “He liberates them from the eight unwholesome factors and sets each of them on the eightfold noble path.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ།
en: Sons of noble family, it is like this.

source: དཔེར་ན་ཟླ་བའི་དཀྱིལ་འཁོར་ནི་ཐབས་ལ་མཁས་པ་དང་ལྡན་པས་ཇི་ལྟར་ཁམས་ཀྱི་དགེ་བའི་རྩ་བ་འདུལ་བའི་སེམས་ཅན་རྣམས་ཀྱི་དོན་དུ་བདག་ཉིད་མི་སྣང་བར་ཡང་སྟོན།
en: Consider the analogy of the moon which, for the sake of beings to be converted, manifests skillfully to them according to the roots of virtue that constitute their dispositions. It makes itself invisible,

source: ཟླ་བ་ཁམ་པ་ལྟ་བུའི་དཀྱིལ་འཁོར་ཀྱང་སྟོན།
en: or shows itself as a half-moon, [or waning, or waxing, or as a full moon].

source: ཟླ་བ་མར་གྱི་ངོ་དང་། ཡར་གྱི་ངོ་ཡང་སྟོན།
en: or shows itself as [a half-moon, or] waning, or waxing, [or as a full moon].

source: ཟླ་བའི་དཀྱིལ་འཁོར་ཡོངས་སུ་རྒྱས་པ་ཡང་སྟོན།
en: or shows itself [as a half-moon, or waning, or waxing, or] as a full moon.

source: མུན་ནག་ཐིབས་པོ་ཐམས་ཅད་ཀྱང་རྣམ་པར་སེལ།
en: It dispels all obscurity and darkness,

source: རྩྭ་དང་། ཤིང་གེལ་པ་དང་། སྨན་དང་། འབྲས་ལ་སོགས་པ་ཡང་སིམ་པར་བྱེད་དོ། །
en: and refreshes all the grass, forests, medicinal herbs, and crops.

source: ཀྱེ་རྒྱལ་བའི་བུ་དག་དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པས་ཀྱང་སྡུག་བསྔལ་རྣམ་པ་སྣ་ཚོགས་ཀྱིས་བསྒྲིབས་པའི་སེམས་ཅན་རྣམས་དང་། ཁམས་སྣ་ཚོགས་ཀྱིས་འདུལ་བའི་སེམས་ཅན་རྣམས་ཀྱི་སྤྱོད་པ་མཁྱེན་ནས་
en: Likewise, sons of the Victorious One, the Tathāgata understands beings who are obscured by various kinds of suffering, as well as the conduct of beings who are to be converted in keeping with their various dispositions.

source: ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་ཡང་སྟོན།
en: He manifests as being in the state of parinirvāṇa,

source: སྐྱེ་བ་ཡང་སྟོན།
en: He manifests [as being in the state of parinirvāṇa,] as being born,

source: འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་ཡང་སྟོན།
en: He manifests [as being in the state of parinirvāṇa, as being born,] as a universal monarch,

source: རྩེ་བ་དང་། དགའ་བ་དང་། བུད་མེད་ཀྱི་བཞད་གད་དང་། ཀུ་རེ་དང་། དྲི་དང་། ཕྲེང་བ་དང་། དགའ་ཞིང་རྩེ་བ་ཡང་སྟོན། །
en: He manifests [as being in the state of parinirvāṇa, as being born, as a universal monarch, and also] as someone joyful who is entertained by amusements and pleasures such as women’s laughter, play, perfume, and garlands.

source: ཁྱིམ་ནས་འབྱུང་བ་དང་། རབ་ཏུ་འབྱུང་བ་དང་། དཀའ་བ་སྤྱད་པ་རྣམས་ཀྱང་སྟོན།
en: He also manifests as someone who renounces the household life, goes forth to live as a renunciant and practices asceticism,

source: བདུད་བཏུལ་བ་དང་། ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ་ནས་ཆོས་ཀྱི་སྤྲིན་ཆེན་པོའི་ཆར་ཕབ་པས་སེམས་ཅན་རྣམས་ཚིམ་པར་བྱས་པའི་བར་དུ་ཡང་སྟོན་ཏེ།
en: He also manifests [as someone who renounces the household life, goes forth to live as a renunciant and practices asceticism, and eventually] as someone who, having tamed Māra and turned the wheel of Dharma, pleases beings by bringing down the rain of the great cloud of Dharma.

source: དེ་བཞིན་གཤེགས་པ་རྣམས་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ཀྱང་སྦྱོར་བ་སྣ་ཚོགས་ཀྱིས་རིང་བསྲེལ་མཆོད་པ་དང་། མཆོད་རྟེན་དང་། གཙུག་ལག་ཁང་དང་། སྐུ་གཟུགས་བྱེད་དུ་གཞུག་པ་དང་། རབ་ཏུ་འབྱུང་བའི་ཕྱིར་ཁྱིམ་ནས་འབྱུང་བ་དང་། དགེ་སློང་གི་དགེ་འདུན་ལ་མཆོད་པ་དང་། དམ་པའི་ཆོས་འདྲི་བ་དང་། བཀླག་པ་དང་། ཁ་ཏོན་དུ་བྱ་བ་ལ་སྤྲོ་བ་བསྐྱེད་པ་དག་གིས་ཀྱང་སེམས་ཅན་ཐམས་ཅད་ཐར་བར་མཛད།
en: The tathāgatas have attained parinirvāṇa. Yet they liberate all beings through various practices such as zealously venerating relics; having stūpas, monasteries, and images constructed; giving up the household life for the sake of going forth as a renunciant; and venerating the Saṅgha of monks, as well as copying, reading, and reciting the noble Dharma.

source: བསླབ་པ་འཛིན་པ་དང་། བརྟུལ་ཞུགས་དང་། སྡོམ་པ་དང་། ཉེ་བར་གནས་པ་དང་། དགེ་བསྙེན་གྱི་སྡོམ་པ་རྣམས་འཛིན་དུ་གཞུག་པའི་ཐབས་མཁས་པས་ཀྱང་སེམས་ཅན་རྣམས་ཐར་བར་མཛད་དེ
en: They also liberate beings through skillful means such as maintaining the training, the way of life, the monastic vows, fasting, and the lay pledges.

source: སེམས་ཅན་དམྱལ་བ་དང་། དུད་འགྲོའི་སྐྱེ་གནས་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་དང་། མི་ཁོམ་པ་དང་། ངན་སོང་དང་། ངན་འགྲོ་ཐམས་ཅད་ལས་ཡོངས་སུ་ཐར་བར་མཛད་ནས་
en: They liberate these beings from rebirths as hell beings, animals, and beings born in Yama’s world, and from existences deprived of the eight freedoms, as well as from negative rebirths and negative forms of existence, and so forth, and

source: ཆོས་ཉན་པས་ཚིམ་པར་མཛད་དེ
en: comfort these beings by having them listen to the Dharma and

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་བར་དུ་བཀོད་དོ། །
en: bringing them to unsurpassable, truly perfect awakening.”

source: དེ་ནས་དེའི་ཚེ་ན་ལྷའི་བུ་བློ་ཆུང་བ་ཁ་ཅིག་ནི་འདི་སྙམ་དུ་སེམས་པར་གྱུར་ཏེ།
en: At that point, some dim-witted gods thought,

source: ཇི་ལྟར་སྔོན་གྱི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེ་དག་གིས་དེ་བཞིན་གཤེགས་པའི་མཛད་པ་མཛད་དེ།
en: “The tathāgatas of earlier times, who were arhats and fully awakened buddhas, accomplished the deeds of a tathāgata. That is to say,

source: སྐུ་ཚེ་ཤིན་ཏུ་རིང་པོར་བྱིན་གྱིས་བརླབས་ནས་
en: after extending their own lifespan through their blessings,

source: སེམས་ཅན་ཐམས་ཅད་སྐྱེ་བ་དང་། རྒ་བ་དང་། ན་བ་དང་། འཆི་བ་དང་། མྱ་ངན་དང་། སྨྲེ་སྔགས་འདོན་པ་དང་། སྡུག་བསྔལ་བ་དང་། ཡིད་མི་བདེ་བ་དང་། འཁྲུག་པ་ཐམས་ཅད་ལས་ཡོངས་སུ་ཐར་བར་མཛད་པ་
en: they liberated all beings from birth, old age, sickness, death, sorrow, lamentation, suffering, unhappiness, and trouble.

source: དེ་ལྟར་དེ་བཞིན་གཤེགས་པ་འདིས་དེ་བཞིན་གཤེགས་པའི་མཛད་པ་ཐམས་ཅད་ད་དུང་མ་མཛད་ཀྱིས་ཀྱང་། འདིས་མྱ་ངན་ལས་འདའ་བ་ལ་ཤིན་ཏུ་བསྔགས་ཤིང་བརྗོད་དེ
en: Likewise, this tathāgata, although he has not yet accomplished all the deeds of a tathāgata, is also extolling and teaching nirvāṇa.

source: འཁོར་མང་པོ་བསྡུས་ནས་རྫུ་འཕྲུལ་དང་རྣམ་པར་འཕྲུལ་བའི་ཆོ་འཕྲུལ་སྣ་ཚོགས་སྟོན་པ་ལས་ན།
en: And he is displaying supernatural powers and miracles of extraordinary transformations after having assembled a great retinue.

source: དེ་ཅི་དེ་བཞིན་གཤེགས་པ་འདི་མྱུར་བ་ཉིད་དུ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་བཞེད་པ་ལྟ་སྙམ་ནས་དེ་དག་ཡིད་མི་དགའ་སྟེ་ཅང་མི་སྨྲ་བར་གྱུར་ཏོ། །
en: So does this tathāgata also seek parinirvāṇa right away?” With this thought, they were depressed and fell silent.

source: དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པའི་སེམས་ཀྱིས་ལྷའི་བུ་དེ་དག་གི་སེམས་ཤེས་ནས་ལྷའི་བུ་དེ་དག་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: The youthful Mañjuśrī then clairvoyantly understood what those gods were thinking and said to them,

source: ལྷའི་བུ་དག་དེ་ལྟར་མ་སེམས་མ་སྨྲ།
en: “Gods, do not think like that, do not say such things.

source: ཡིད་མི་དགའ་བར་མ་བྱེད་ཅིག །
en: Do not be depressed.

source: དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་ཐབས་མཁས་པ་ནི་མང་སྟེ།
en: Many are the skillful means of the tathāgatas.

source: ཐབས་དང་། ཤེས་རབ་དང་། ཏིང་ངེ་འཛིན་སྣ་ཚོགས་ཀྱི་དགེ་བའི་རྩ་བའི་སྟོབས་ཀྱི་བྱིན་གྱི་རླབས་ཀྱིས་སེམས་ཅན་བསམ་པ་སྣ་ཚོགས་དག་ལ་ཆོས་སྟོན་ཏེ།
en: They teach the Dharma to beings of diverse inclinations by means of their sovereign power, and the power of their roots of virtue, which consists of various methods, insights, and states of concentration.

source: ལྷའི་བུ་དག་ངས་སྔོན་གྱི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་ཐབས་མཁས་པའི་རྫུ་འཕྲུལ་དང་། རྣམ་པར་འཕྲུལ་བའི་ཆོ་འཕྲུལ་ཇི་ལྟར་མཐོང་བ་དེ་ལྟར་ངས་ཤེས་པ་ལས་ན།
en: Gods, since I have seen the supernatural powers and miracles of extraordinary transformations that are the skillful means of the tathāgatas of the past, I know.

source: དེ་བཞིན་གཤེགས་པ་ནི་སངས་རྒྱས་ཀྱི་སྟོབས་སྐྱེད་པའི་ཆོ་འཕྲུལ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ་སྡེའི་རྒྱལ་པོ་འཆད་པར་བཞེད་པ་དང་། རྒྱས་པར་མཛད་པར་བཞེད་པར་མི་འགྱུར་རམ། ཡང་ལྷའི་བུ་དག་དེ་བཞིན་གཤེགས་པ་རྣམས་ནི་ཡོངས་སུ་མྱ་ངན་ལས་མི་འདའ་སྟེ
en: So surely the Tathāgata will indeed wish to expound and spread the king of sūtras of the great vehicle called The Teaching on the Extraordinary Transformation that is the Miracle of Attaining the Buddha’s Powers.

source: དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་ཡང་མེད།
en: Moreover, gods, the tathāgatas do not enter parinirvāṇa, because there is no parinirvāṇa of the tathāgatas,

source: སྐུ་ཚེ་ཟད་པར་འགྱུར་བ་ཡང་མེད།
en: nor are their lives ever exhausted.

source: བསྐལ་པ་བྱེ་བ་དཔག་ཏུ་མེད་པའི་བསྐལ་པ་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པར་དེ་བཞིན་གཤེགས་པ་རྣམས་བཞུགས་མོད་ཀྱི།
en: The tathāgatas remain for immeasurable millions of eons, for utterly inexpressible eons.

source: ཐབས་མཁས་པས་སེམས་ཅན་རྣམས་ལ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་ཡང་སྟོན། དམ་པའི་ཆོས་ནུབ་པར་འགྱུར་བ་ཡང་སྟོན་ཏོ། །
en: But through their skillful means they display their parinirvāṇa to beings, as well as the disappearance of the noble Dharma.

source: སེམས་ཅན་མྱ་ངན་ལས་འདའ་བས་འདུལ་བ་དང་། རིང་བསྲེལ་གྱིས་འདུལ་བའི་སྙིགས་མའི་རང་བཞིན་ཅན། དེ་བཞིན་གཤེགས་པ་ལ་མ་དད་པ། བླ་མ་ལ་བསྟི་སྟང་བྱེད་པར་མི་འགྱུར་བའི་སེམས་ཅན་དག་ཇི་ལྟ་ཇི་ལྟར་མཐོང་བ། དེ་ལྟ་དེ་ལྟར་དེ་བཞིན་གཤེགས་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་སྟོན་མོད་ཀྱི།
en: Just as the Tathāgata sees the various beings of an impure nature who are to be converted by means of parinirvāṇa or by relics, who have no faith in the Tathāgata, and who are irreverent toward the master, so in each such case the Tathāgata displays his parinirvāṇa.

source: དེ་བཞིན་གཤེགས་པ་ནི་བྱོན་པ་ཡང་མེད།
en: But in fact, the Tathāgata neither comes [nor goes].

source: གཤེགས་པ་མེད་དོ། །
en: But in fact, the Tathāgata [neither comes] nor goes.

source: གང་གི་ཚེ་སེམས་ཅན་རྣམས་དགེ་བའི་རྩ་བ་ཡོངས་སུ་སྨིན་པར་གྱུར་ཅིང་དེ་བཞིན་གཤེགས་པ་ལ་བལྟ་བར་འདོད་པ་དང་། མཆོད་པར་འོས་པ་དང་། ཆོས་ཉན་པར་འདོད་པ་དང་། ཟླ་བའི་དཀྱིལ་འཁོར་བཞིན་དུ་འདོད་པར་གྱུར་པ་དེའི་ཚེ་ལྷ་དང་མི་རྣམས་ཀྱི་སྐྱེ་བོ་མང་པོ་ལ་ཕན་པ་དང་། སྐྱེ་བོ་མང་པོ་ལ་བདེ་བར་བྱ་བ་དང་། དཀོན་མཆོག་གསུམ་གསལ་བར་བྱ་བ་དང་། རྒྱས་པར་བྱ་བའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་འཇིག་རྟེན་དུ་འབྱུང་མོད་ཀྱི། དེ་བཞིན་གཤེགས་པ་ལ་སྐྱེ་བ་མེད་དེ
en: When the roots of virtue of beings have fully matured, and they long to look upon the Tathāgata, are worthy of veneration, long to listen to the Dharma, and their longing is like the full moon, at that time, the Tathāgata appears in the world for the benefit and happiness of many beings such as gods and humans, and for the sake of manifesting and propagating the Three Jewels to them.

source: རྒ་བ་དང་འཆི་བ་ཡང་མེད་དོ། །
en: But in fact, the Tathāgata is not born, nor does he age or die.

source: དཔེར་ན་མེ་ལོང་གི་དཀྱིལ་འཁོར་ཤིན་ཏུ་ལེགས་པར་ཕྱིས་པ་ལ་གཟུགས་སྣ་ཚོགས་སྣང་བར་འགྱུར། མི་སྣང་བར་ཡང་འགྱུར་མོད་ཀྱི།
en: As an analogy, although many forms might appear and disappear in a well-polished mirror,

source: གཟུགས་བརྙན་ནི་དེར་འོང་བ་དང་། འགྲོ་བར་སྣང་བ་ནི་མེད་དོ། །
en: one never sees the reflected image actually entering the mirror or leaving it.

source: ལྷའི་བུ་དག་དེ་བཞིན་གཤེགས་པའི་སྐུ་ལ་ཡང་དེ་ལྟར་བལྟ་བར་བྱའོ། །
en: Gods, you should also look upon the body of the Tathāgata in this way.

source: དཔེར་ན་སྒྱུ་མ་བྱེད་པ་ལེགས་པར་བསླབས་པ་ནི་གྲོང་ཁྱེར་དང་། རྟ་བབས་དང་། སྐྱེད་མོས་ཚལ་སྣ་ཚོགས་དང་། ཤིང་རྟ་སྣ་ཚོགས་དང་། འཁོར་ལོས་སྒྱུར་བའི་གཟུགས་དང་། དགའ་བ་དང་། རྩེ་བ་སྣ་ཚོགས་བསྟན་ཏེ་
en: As an analogy, a well-trained conjurer displays various cities, archways, parks, vehicles, physical forms of a universal monarch, amusements, and entertainments.

source: མི་སྣང་བར་བྱེད་ཀྱང་དེ་ལ་འཕོ་བ་ཡང་མེད།
en: Even if he makes these illusions cease, they do not move anywhere,

source: འོང་བ་ཡང་མེད།
en: nor do they come [or go].

source: འགྲོ་བ་ཡང་མེད་དོ། །
en: nor do they [come or] go.

source: དེ་བཞིན་དུ། དེ་བཞིན་གཤེགས་པ་རྣམས་འབྱུང་བ་དང་། ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་ལ་ཡང་བལྟ་བར་བྱའོ། །
en: You should regard the appearance of the tathāgatas and their parinirvāṇa in the same way.

source: ཡང་ལྷའི་བུ་དག་སྔོན་གྱི་སྨོན་ལམ་གྱིས་དེ་བཞིན་གཤེགས་པ་མྱ་ངན་ལས་འདས་ནས་ལོ་སྟོང་ལོན་པའམ། མྱ་ངན་ལས་འདས་ནས་བསྐལ་པར་ལོན་པའམ། མྱ་ངན་ལས་འདས་ནས་བསྐལ་པ་བྱེ་བར་ལོན་ཡང་
en: “Moreover, gods, the tathāgatas, even though a thousand years, an eon, or ten million eons may have elapsed since their parinirvāṇa, because of their former vows, and

source: སེམས་ཅན་རྣམས་ཀྱིས་མཆོད་པར་བྱ་བ་དང་། བཀུར་སྟིར་བྱ་བ་དང་། རིང་བསྲེལ་གྱི་མཆོད་རྟེན་བྱེད་དུ་གཞུག་པ་དང་། སྐུ་གཟུགས་བྱེད་དུ་གཞུག་པ་དང་། མཚན་ནས་བརྗོད་པ་དང་། དམ་པའི་ཆོས་འཛིན་པ་དང་། མཆོད་པ་བྱེད་པའི་སེམས་ཅན་འཇིག་རྟེན་གྱི་ཁམས་སྣ་ཚོགས་ན་གནས་པ་རྣམས་ཐར་པར་མཛད་དེ
en: on account of the fact that sentient beings worship them, venerate them, construct relic stūpas, create images, recite their names, and preserve and venerate the holy Dharma, liberate beings

source: སེམས་ཅན་དམྱལ་བ་དང་། དུད་འགྲོའི་སྐྱེ་གནས་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་དང་། མི་ཁོམ་པ་དང་། ངན་སོང་དང་། ངན་འགྲོ་ལོག་པར་ལྟུང་བ་ཐམས་ཅད་དང་། སྡུག་བསྔལ་ཐམས་ཅད་ལས་ཡོངས་སུ་ཐར་བར་མཛད་ནས་
en: liberate beings from all the hells, animal births, the world of Yama, downfalls into inopportune existences, unfortunate destinies, bad rebirths, and all suffering, even though these tathāgatas might belong to different world systems,

source: རིམ་གྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་བར་དུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ན
en: until beings gradually attain unsurpassable, truly perfect enlightenment. Thus,

source: གང་དག་དེ་བཞིན་གཤེགས་པ་ལ་མངོན་སུམ་དུ་མེ་ཏོག་དང་། སྤོས་དང་། དྲི་དང་། ཕྲེང་བ་དང་། བྱུག་པ་དང་། ན་བཟའ་དང་། རྒྱན་རྣམས་ཀྱི་མཆོད་པས་མཆོད་པ་ལྟ་སྨོས་ཀྱང་ཅི་དགོས།
en: what need is there to mention those who worship the tathāgatas in person by offering them flowers, incense, perfume, garlands, salves, clothes, and aromatic powders?

source: ལྷའི་བུ་དག་གང་སེམས་ཅན་ལ་ལས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་མྱ་ངན་ལས་འདས་ནས་ལོ་བརྒྱ་སྟོང་ངམ། བསྐལ་པ་བྱེ་བ་ལོན་ཡང་སངས་རྒྱས་ལ་ཕྱག་འཚལ་ལོ་ཞེས་མཚན་ནས་ལན་བདུན་དུ་བརྗོད་ནས་ནམ་མཁའ་ལ་མེ་ཏོག་གཏོར་ན་
en: Gods, even though one thousand years, an eon, or even ten million eons may have elapsed since the Bhagavān Buddha entered parinirvāṇa, if some beings throw a flower in the sky, after calling the Tathāgata by his name seven times and saying ‘Homage to the Buddha,’

source: དེ་དག་ཐམས་ཅད་སྡུག་བསྔལ་གྱི་མཐར་བྱེད་པར་འགྱུར་རོ། །
en: they will all bring an end to their suffering.

source: མེ་ཏོག་ནམ་མཁའ་ལ་གཏོར་བལྟ་ཞོག་གི།
en: But, let alone throwing a flower in the sky,

source: གང་དག་དད་པས་དེ་བཞིན་གཤེགས་པའི་རྗེས་སུ་སློབ་པ་ལ་ལ་ཞིག་གིས་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པའི་ཕྱིར་དེ་བཞིན་གཤེགས་པའི་ཚུལ་ཁྲིམས་བསླབ་པ་གཅིག་ཙམ་འཛིན་ཏམ་ཉིན་གཅིག་གམ། མཚན་གཅིག་གམ། ཡུད་ཙམ་ཞིག་ལ་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པ་ཡིད་ལ་བྱེད་པར་བརྩོན་ན
en: if someone, whoever they might be, faithfully emulating the Tathāgata, strives to maintain even a single precept in order to honor the Tathāgata, or strives to focus on worshipping the Tathāgata even for a single day, or a single night, or a single moment,

source: དེ་སྡུག་བསྔལ་མཐར་བྱས་ནས་རིམ་གྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་རོ། །
en: this person will put an end to suffering and gradually, fully, and completely awaken to unsurpassable, truly perfect enlightenment.

source: གང་གིས་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པའི་ཕྱིར་བཞད་གད་དམ། ཀུ་རེའམ། བྱིས་པའི་ཀྱལ་ཀའམ། རྩེད་མོར་བྱེད་པའམ། འཇིམ་པ་ལས་མཆོད་རྟེན་བྱེད་ན།
en: If even those who, in order to honor the Tathāgata, laugh, have fun, joke like fools, play games, or make a stūpa from sand

source: དེ་དག་ཐམས་ཅད་སྡུག་བསྔལ་མཐར་བྱས་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ན།
en: will all put an end to suffering and fully and completely awaken to unsurpassable, truly perfect enlightenment,

source: གང་གིས་རིང་བསྲེལ་གྱི་མཆོད་རྟེན་ནམ། རིང་བསྲེལ་གྱི་སྐུ་གཟུགས་བྱས་ཏེ།
en: what need is there to mention those who have built relic stūpas or relic images and,

source: སེམས་ཅན་ཐམས་ཅད་ལ་སྙིང་རྗེ་གཙོ་བོར་ཤེས་ནས་
en: understanding that compassion toward all beings is the most important thing,

source: སེམས་ཅན་ཐམས་ཅད་སྡུག་བསྔལ་ལས་ཡོངས་སུ་དགྲོལ་ལོ་སྙམ་སྟེ་
en: think, ‘I shall liberate all beings from suffering’?

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་སྐྱེས་ནས་ལྷའི་མེ་ཏོག་དང་། ལྷའི་སྤོས་དང་། ཕྲེང་བ་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། སིལ་སྙན་དང་། གདུགས་དང་། རྒྱལ་མཚན་རྣམས་ཀྱིས་མཆོད་པ་བྱེད་པ་ལྟ་སྨོས་ཀྱང་ཅི་དགོས་ཏེ
en: And what need is there to mention those who, having produced the thought directed toward unsurpassable, truly perfect awakening, make offerings of divine flowers and incense, garlands, salves, aromatic powders, cymbals, umbrellas, and royal banners?

source: དེས་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ལ་མཆོད་པ་བྱས་པར་འགྱུར་རོ། །
en: Those who have thus made offerings to all the tathāgatas

source: དེ་ནི་སྐྱེ་བ་དང་། རྒ་བ་དང་། ན་བ་དང་། འཆི་བ་དང་། མྱ་ངན་དང་། སྨྲེ་སྔགས་འདོན་པ་དང་། སྡུག་བསྔལ་བ་དང་། ཡིད་མི་བདེ་བ་དང་། འཁྲུག་པ་རྣམས་ལས་ཡོངས་སུ་ཐར་བར་འགྱུར་ཏེ
en: [Those who have thus made offerings to all the tathāgatas] will be free from birth, old age, sickness, and death, as well as from misery, lamentation, suffering, unhappiness, and afflictions.

source: ཇི་སྲིད་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པར་མ་གྱུར་པ་དེ་སྲིད་ཀྱི་བར་དུ་བདེ་འགྲོར་འགྲོ་བར་འགྱུར་རོ། །
en: And as long as they have not completely and fully awakened to unsurpassable, truly perfect awakening, they will be reborn in pleasant forms of existence.

source: ལྷའི་བུ་དག་དེ་ལྟར་ན་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་སྔོན་གྱི་སྨོན་ལམ་ལ་མཁས་ཤིང་འཐུན་པ་ཡོངས་སུ་དག་པ་ཡིན་ནོ། །
en: Gods, thus can one discern the aspiration of the tathāgatas of the past and be in perfect agreement with it.”

source: དེ་ནས་ལྷའི་བུ་དེ་དག་འདི་སྙམ་དུ་སེམས་པར་གྱུར་ཏེ།
en: Then, those gods thought,

source: ཀྱེ་མའོ། །འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་འདི་ནི་ཤེས་རབ་ཆེན་པོ་དང་ལྡན་ནོ། །
en: “Oh, this youthful Mañjuśrī is endowed with great insight.

source: དེ་བཞིན་གཤེགས་པ་རྣམས་མཆོག་ཏུ་ཐབས་མཁས་པ་དང་ལྡན་པ་ནི་ལགས་ན།
en: If the tathāgatas possess supreme skillful means,

source: གང་འཇམ་དཔལ་གྱིས་དེ་བཞིན་གཤེགས་པ་རྣམས་མྱ་ངན་ལས་འདས་ནས་བསྐལ་པ་བྱེ་བ་དུ་མ་ལོན་ཡང་འཇིག་རྟེན་གྱི་ཁམས་དག་ན་བཞུགས་ཤིང་ཐབས་མཁས་པ་སྣ་ཚོགས་ཀྱིས་སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་མཛད་དོ་ཞེས་དེས་སྨྲས་པ་དེ་ལྟ་བུ་འདི་ཅི་ཞིག་སྙམ་མོ། །
en: what does it mean when Mañjuśrī says that the tathāgatas remain in the world systems and bring beings to spiritual maturity through various skillful means, even though ten billion eons have passed many times over since the tathāgatas attained nirvāṇa?”

source: འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པའི་སེམས་ཀྱིས་ལྷའི་བུ་དེ་དག་གི་སེམས་ཤེས་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: The youthful Mañjuśrī, having clairvoyantly understood what those gods were thinking, said,

source: ལྷའི་བུ་དག་ལེགས་སོ་ལེགས་སོ། །
en: “Gods, excellent! Excellent!

source: ཡུད་ཙམ་ཞིག་སྡོད་ཅིག །
en: Just wait a moment.

source: ཁྱོད་ཀྱི་ཡིད་ལ་བྱེད་པ་སྐྱེས་པ་འདི་དང་སྔར་ཞུས་པར་གྱུར་པ་ཡང་དེ་བཞིན་གཤེགས་པའི་བྱིན་གྱི་རླབས་ཡིན་ནོ། །
en: These thoughts arising in your mind, as well as your earlier question, are also the sovereign power of the Tathāgata.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཇི་ལྟ་བུའི་རྫུ་འཕྲུལ་མངོན་པར་འདུ་མཛད་པ་མངོན་པར་མཛད་པས་དེ་བཞིན་གཤེགས་པ་གཙུག་ཕུད་ཅན་དང་། ཐམས་ཅད་སྐྱོབ་དང་། ལོག་པར་དད་སེལ་དང་། གསེར་ཐུབ་དང་། འོད་སྲུང་དང་། རྣམ་པར་གཟིགས་དང་། མི་འཁྲུགས་པ་དང་། འོད་དཔག་ཏུ་མེད་པ་དེ་དག་འཁོར་གྱི་དཀྱིལ་འཁོར་ན་བཞུགས་ཤིང་དེ་བཞིན་གཤེགས་པ་སེང་གེའི་ཁྲི་ཆེན་པོ་ལ་བཞུགས་ནས་ཉན་ཐོས་དང་། བྱང་ཆུབ་སེམས་དཔར་བཅས་པས་བསྐོར་ཅིང་འཁོར་རྒྱ་མཚོ་ལྟ་བུ་ལ་ཆོས་སྟོན་པར་སྣང་བ་དང་།
en: At this, the Blessed One displayed his supernatural powers and the tathāgatas Śikhin, Viśvabhū, Krakucchanda, Kanakamuni, Vipāśyin, Akṣobhya, and Amitābha appeared in his surrounding retinue, sitting on lion thrones surrounded by the saṅgha of śrāvakas and bodhisattvas, and taught the Dharma to an ocean-like retinue.

source: ཤར་དང་། ལྷོ་དང་། ནུབ་དང་། བྱང་གི་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་དག་ན་ཡང་དེ་བཞིན་གཤེགས་པ་དུ་མ་སེང་གེའི་ཁྲི་ཆེན་པོ་ལ་བཞུགས་ནས་ཆོས་འཆད་ཅིང་བཞུགས་པར་མཐོང་བ་དེ་ལྟ་བུའི་རྫུ་འཕྲུལ་མངོན་པར་འདུ་མཛད་པ་མངོན་པར་མཛད་དོ། །
en: They too displayed those same types of supernatural powers by manifesting many tathāgatas sitting on their lion thrones, expounding the Dharma throughout the world systems of the east, south, west, and north.

source: དེ་ནས་ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དང་། ལྷའི་བུ་དེ་དག་དགའ་བར་གྱུར་ཏེ། མཆོག་ཏུ་དགའ་ཞིང་ཡིད་བདེ་བ་སྐྱེས་ནས་
en: The retinue of all those gathered and the gods rejoiced, jubilated, and were pleased.

source: བདག་གིས་དགེ་བའི་རྩ་བ་ལས་སྐྱེས་པའི་བསོད་ནམས་ཀྱི་སྟོབས་བསྐྱེད་པས་དེ་བཞིན་གཤེགས་པ་དེ་དག་ལ་མེ་ཏོག་དང་། སྤོས་དང་། དྲི་དང་། ཕྲེང་བ་དང་། བྱུག་པ་དང་། ན་བཟའ་དང་། རྒྱན་རྣམས་ཀྱིས་མངོན་པར་མཆོད་དེ
en: Having themselves increased the power of the roots of virtue arising from their merit, they worshipped the tathāgatas with flowers, incense, perfume, garlands, salves, garments, and ornaments, and

source: ལན་གསུམ་དུ་བསྐོར་བ་བྱས་ནས་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ། །
en: circumambulated them three times, proclaiming the following verses:

source: ཨེ་མ་ཡེ་ཤེས་ཡེ་ཤེས་ནི། །ཏིང་ངེ་འཛིན་དང་ཤེས་རབ་སྒོམ། །
en: “How wonderful is this gnosis! For this, one should practice the state of concentration and insight!

source: ཇི་ལྟར་འཇིག་རྟེན་སྒྲོན་མ་རྣམས། །འདས་ནས་བསྐལ་པ་དུ་མ་ན། །སེམས་ཅན་རྣམས་ལ་ཕན་པའི་ཕྱིར། །དཔའ་བོ་ཆེན་པོ་འདི་ན་བཞུགས། །
en: Just like lights illuminating the world, This great hero will remain “For the benefit of beings For many eons after his nirvāṇa.

source: བྱང་ཆུབ་སེམས་དཔས་ཡོངས་བསྐོར་ཅིང་། །སེང་གེའི་ཁྲི་ལ་བཞུགས་པ་གདའ། །
en: Surrounded by bodhisattvas, He is seated on a lion throne.

source: སངས་རྒྱས་མཐོང་བ་ལེགས་པ་སྟེ། །
en: “Seeing the Buddha is excellent.

source: ཆོས་མཉན་པ་ཡང་ལེགས་པ་ཡིན། །
en: Listening to the Dharma is excellent.

source: དགེ་བའི་བཤེས་གཉེན་བལྟ་བ་དང་། །མཉན་པའང་དེ་བཞིན་ལེགས་པ་ཡིན། །
en: Likewise, observing a spiritual friend And listening to him is also excellent.

source: གང་དག་འདིར་ནི་བསླབ་འཛིན་པའི། །ལུས་ཀྱི་སྡོམ་པ་ལེགས་པ་ཡིན། །
en: “All the precepts of the body That preserve the training are excellent.

source: ནན་ཏན་གྱིས་ནི་སྒྲུབ་པ་དག །དེ་ཀུན་བྱང་ཆུབ་ཐོབ་པར་འགྱུར། །
en: Those who have diligently perfected them Will all achieve awakening.

source: ཐབས་དང་ཤེས་རབ་མཁས་པ་རྣམས། །འདིར་ནི་སེམས་ཅན་ཐར་བར་མཛད། །
en: “Those who are skillful in means and insight Will liberate beings in this world.
